[
  {
    "title": "Best Practices for Managing Data in your Research",
    "start": "2025-10-01T14:30:00.000Z",
    "end": "2025-10-01T15:30:00.000Z",
    "location": "",
    "description": "TIFU (Today I F'ed Up) by losing a ton of data for my research \r- Have you ever seen a description like this on Reddit? Are your desktop \rand downloads folders a jumble of files named Data-finalFINAL-USETHISONE? \rIs all of your lab's data stored on a single drive located conveniently \runder a sprinkler system? Join research data management services and learn \rhow investing a small amount of time in organizing your data now can save \ryou a lot of time and prevent future headaches. In this introductory \rworkshop, learn about research data management best practices. We will go \rover best practices for data planning, storage, organization, \rpreservation, and sharing.\n\nBy the end of the session, participants \rwill be empowered to:\n\n\n\tProduce a plan for their data\n\tOrganize and \rdocument their data consistently\n\tStore and back-up their data \rsecurely\n\tSelect an appropriate data repository for archival and \rsharing\n\n\nNo prior experience with data management is required! This \rsession is perfect for anyone who wants to feel more confident organizing, \rstoring, and sharing their data in clear and practical ways.\n\nDetails: \rAny preparatory work for the session can be found on its information page. \rThis virtual workshop will be recorded. The recording will be posted to the \rSherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: \n\nIsaac \rPratt (he/him) is a research scientist by training and has a PhD in Anatomy \r& Cell Biology. He leverages nearly a decade of interdisciplinary research \rexperience to help support students, staff, and faculty. His expertise \rlies in questions surrounding data storage, security, planning, \rarchival, and sharing. Isaac also provides support and curation services \rfor McMaster Dataverse. His other interests include reproducible research \rmethods, open science, and data science.\n\nDanica Evering holds \rexpansive experience with research support, education, project \rmanagement, advocacy, and knowledge translation; with fluency in social \rpractice art, healthcare, community research, data, and systems \rdevelopment. Danica supports students, postdocs, faculty, and staff with \rRDM through the data lifecycle—Data Management Plans, storage and \rbackup, data security, data sharing. With an MA in Media Studies from \rConcordia, they are interested in fostering RDM within curious scholars \rand disciplines.",
    "url": "https://libcal.mcmaster.ca/calendar/scds/intro-rdm1"
  },
  {
    "title": "Data Management Plan Bootcamp (Virtual)",
    "start": "2025-11-19T18:00:00.000Z",
    "end": "2025-11-19T21:00:00.000Z",
    "location": "",
    "description": "Our popular DMP Bootcamp is back, reformatted into a hands-on \ronline intensive for remote researchers on the go! Data Management Plans \r(DMPs) are both incredibly helpful research tools and increasingly required \rfor grants but it can hard to know how to complete a Data Management Plan \rif it’s your first time. This session is carefully timed for researchers \rcompleting a CFI or Tri-Agency grant. If you're in the process of creating \ra DMP, either for a grant application or for your own research, join RDM \rServices for this afternoon session. The RDM Services team will provide \rtailored guidance as you write your plan online--we'll pop into your \rbreakout rooms to make sure everything is going smoothy. Come away with a \rclear path forward or even a finished DMP!\n\nBy the end of this session, \rparticipants will be able to:\n\n\n\tIdentify the 5 key components of a data \rmanagement plan (DMP).\n\tCompare strong and weak responses in each section \rof a DMP.\n\tDevelop a tailored outline, or potentially a complete draft, \rof their own DMP!\n\n\nThis participatory session is especially relevant \rfor researchers at all levels in the beginning stages of a research project \ror streamlining best practices for their research team. Come on your own, \rsend your research staff, or bring your whole research group. Let us know \rif you're joining as a research team - we'll make sure you get an online \rbreakout room to work together in! Bring your own snacks to your desk and \renjoy this dedicated time to work on your plan with extra \rsupport.\n\nDetails: Any preparatory work for the session can be found on \rits information page. This workshop will not be recorded.\n\nFacilitator \rBio: \n\nDanica Evering (they/them) is a Research Data Management \rSpecialist grounded in curiosity and a deep commitment to ethics. Danica is \ravailable to help students, postdocs, faculty, and staff with RDM \rthrough the data lifecycle—Data Management Plans, storage and backup, \rdata security, data sharing. With an MA in Media Studies, Danica fosters \ractive interest in RDM across disciplines, with a knack for engaging \rresearchers who might not even realize they have data to manage. Outside of \rwork they sing in a choir, play PC games, maintain an art writing \rpractice, grow a garden, contribute Wikipedia articles, and run.",
    "url": "https://libcal.mcmaster.ca/calendar/scds/dmp-bootcamp1"
  },
  {
    "title": "Data Management Plan Bootcamp (In-Person)",
    "start": "2025-11-25T18:00:00.000Z",
    "end": "2025-11-25T21:00:00.000Z",
    "location": "Sherman Centre for Digital Scholarship (1st Floor, Mills Library)",
    "description": "Let us be your body double with this in-person bootcamp! Data \rManagement Plans (DMPs) are both incredibly helpful research tools and \rincreasingly required for grants but it can hard to know how to complete a \rData Management Plan if it’s your first time. This session is carefully \rtimed for researchers completing a CFI or Tri-Agency grant this fall. If \ryou're in the process of creating a DMP, either for a grant application or \rfor your own research, join RDM Services for this afternoon session. The \rRDM services team will provide tailored guidance as you write your plan on \rsite, and we'll have some light snacks and refreshments to keep you going. \rCome away with a clear path forward or even a finished DMP!\n\nBy the end \rof this session, participants will be able to:\n\n\n\tIdentify the 5 key \rcomponents of a data management plan (DMP).\n\tCompare strong and weak \rresponses in each section of a DMP.\n\tDevelop a tailored outline, or \rpotentially a complete draft, of their own DMP!\n\n\nThis participatory \rsession is especially relevant for researchers at all levels in the \rbeginning stages of a research project or streamlining best practices for \rtheir research team. Come on your own, send your research staff, or bring \ryour whole research group. Let us know if you're joining as a research team \r- we'll make sure you get a table to work together at!\n\n\nDetails: Any \rpreparatory work for the session can be found on its information page. This \rvirtual workshop will be recorded and shared on the same page, and \rdiscoverable via the Sherman Centre's Online Learning \rCatalogue.\n\nFacilitator Bio: Isaac Pratt (he/him) is a research scientist \rby training and has a PhD in Anatomy & Cell Biology. He leverages nearly a \rdecade of interdisciplinary research experience to help support students, \rstaff, and faculty. His expertise lies in questions surrounding data \rstorage, security, planning, archival, and sharing. Isaac also provides \rsupport and curation services for McMaster Dataverse. His other interests \rinclude reproducible research methods, open science, and data science.",
    "url": "https://libcal.mcmaster.ca/calendar/scds/dmp-bootcamp2"
  },
  {
    "title": "Best Practices for Managing Data in your Research",
    "start": "2026-01-14T15:30:00.000Z",
    "end": "2026-01-14T16:30:00.000Z",
    "location": "",
    "description": "TIFU (Today I F'ed Up) by losing a ton of data for my research \r- Have you ever seen a description like this on Reddit? Are your desktop \rand downloads folders a jumble of files named Data-finalFINAL-USETHISONE? \rIs all of your lab's data stored on a single drive located conveniently \runder a sprinkler system? Join research data management services and learn \rhow investing a small amount of time in organizing your data now can save \ryou a lot of time and prevent future headaches. In this introductory \rworkshop, learn about research data management best practices. We will go \rover best practices for data planning, storage, organization, \rpreservation, and sharing.\n\nBy the end of the session, participants \rwill be empowered to:\n\n\n\tProduce a plan for their data\n\tOrganize and \rdocument their data consistently\n\tStore and back-up their data \rsecurely,\n\tSelect an appropriate data repository for archival and \rsharing.\n\n\nNo prior experience with data management is required! This \rsession is perfect for anyone who wants to feel more confident organizing, \rstoring, and sharing their data in clear and practical ways.\n\nDetails: \rAny preparatory work for the session can be found on its information page. \rThis virtual workshop will be recorded and shared on the same page, and \rdiscoverable via the Sherman Centre's Online Learning \rCatalogue.\n\nFacilitator Bio: \n\nIsaac Pratt (he/him) is a research \rscientist by training and has a PhD in Anatomy & Cell Biology. He leverages \rnearly a decade of interdisciplinary research experience to help support \rstudents, staff, and faculty. His expertise lies in questions surrounding \rdata storage, security, planning, archival, and sharing. Isaac also \rprovides support and curation services for McMaster Dataverse. His other \rinterests include reproducible research methods, open science, and data \rscience.\n\nDanica Evering holds expansive experience with research \rsupport, education, project management, advocacy, and knowledge \rtranslation; with fluency in social practice art, healthcare, community \rresearch, data, and systems development. Danica supports students, \rpostdocs, faculty, and staff with RDM through the data lifecycle—Data \rManagement Plans, storage and backup, data security, data sharing. With \ran MA in Media Studies from Concordia, they are interested in fostering \rRDM within curious scholars and disciplines.",
    "url": "https://libcal.mcmaster.ca/calendar/scds/intro-rdm2"
  }
]