[
  {
    "uid": "LibCal-7565-3916868",
    "title": "Create Simple Maps using Google Maps and Microsoft Excel",
    "start": "2025-09-24T14:30:00.000Z",
    "end": "2025-09-24T15:30:00.000Z",
    "description": "Want to create maps but don’t have the time, patience, or storage space for a new application? We’ve got you covered. This beginner-friendly workshop is designed to show participants how to use familiar tools like Google Maps and Microsoft Excel, to make simple maps for reports, presentations, or even a group chat.\n\nIn this workshop, participants will:\n\n\n\tLearn the basics of using Google Maps and Microsoft Excel to create and visualize spatial data\n\tBecome familiar with spatial data\n\tLearn how to export maps for use in presentations, documents, and websites\n\tUnderstand common mistakes in map making.\n\n\nNo technical expertise is required! This session is geared toward anyone looking to learn more about digital mapping tools and techniques.\n\nDetails: Any preparatory work for the session can be found on its information page. This workshop will not be recorded.\n\nFacilitator Bios:\n\nChristine Homuth (she/her) is the Library's GIS Specialist, providing support and resources to students, researchers, and faculty members working with Geographic Information Systems (GIS) and geospatial data.\n\nSaman’s (she/her) work operates at the intersection of information science and critical geography. She’s particularly interested in the ways in which community-owned and -governed infrastructure can contribute to equitable knowledge systems. Currently, Saman takes care of McMaster’s Lloyd Reeds Map Collection, ensuring community members are able to access, understand, and use the collection for teaching and research.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/user-friendly-maps",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1752790818.png"
  },
  {
    "uid": "LibCal-7565-3916870",
    "title": "Best Practices for Managing Data in your Research",
    "start": "2025-10-01T14:30:00.000Z",
    "end": "2025-10-01T15:30:00.000Z",
    "description": "TIFU (Today I F'ed Up) by losing a ton of data for my research - Have you ever seen a description like this on Reddit? Are your desktop and downloads folders a jumble of files named Data-finalFINAL-USETHISONE? Is all of your lab's data stored on a single drive located conveniently under a sprinkler system? Join research data management services and learn how investing a small amount of time in organizing your data now can save you a lot of time and prevent future headaches. In this introductory workshop, learn about research data management best practices. We will go over best practices for data planning, storage, organization, preservation, and sharing.\n\nBy the end of the session, participants will be empowered to:\n\n\n\tProduce a plan for their data\n\tOrganize and document their data consistently\n\tStore and back-up their data securely\n\tSelect an appropriate data repository for archival and sharing\n\n\nNo prior experience with data management is required! This session is perfect for anyone who wants to feel more confident organizing, storing, and sharing their data in clear and practical ways.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded. The recording will be posted to the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: \n\nIsaac Pratt (he/him) is a research scientist by training and has a PhD in Anatomy & Cell Biology. He leverages nearly a decade of interdisciplinary research experience to help support students, staff, and faculty. His expertise lies in questions surrounding data storage, security, planning, archival, and sharing. Isaac also provides support and curation services for McMaster Dataverse. His other interests include reproducible research methods, open science, and data science.\n\nDanica Evering holds expansive experience with research support, education, project management, advocacy, and knowledge translation; with fluency in social practice art, healthcare, community research, data, and systems development. Danica supports students, postdocs, faculty, and staff with RDM through the data lifecycle—Data Management Plans, storage and backup, data security, data sharing. With an MA in Media Studies from Concordia, they are interested in fostering RDM within curious scholars and disciplines.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/intro-rdm1",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1752792088.png"
  },
  {
    "uid": "LibCal-7565-3916871",
    "title": "Getting Started with Linear Regression in R",
    "start": "2025-10-09T20:00:00.000Z",
    "end": "2025-10-09T21:00:00.000Z",
    "description": "Curious about uncovering patterns in your data? Whether you're investigating how income relates to education or how age and location affect voting behaviour, linear regression helps quantify and interpret relationships between variables.\n\nThis hands-on, intermediate-level workshop introduces linear modeling in R, a powerful and open-source tool for statistical analysis. You’ll learn how to fit a linear model, interpret coefficients, assess model assumptions, and evaluate model performance using diagnostic plots like residuals.\n\nBy the end of this session, participants will be able to:\n\n\n\t\n\tFit a linear regression model using R\n\t\n\t\n\tInterpret key output from a linear model\n\t\n\t\n\tCheck model assumptions and explore diagnostic plots\n\t\n\t\n\tApply linear modeling techniques to real-world data\n\t\n\n\nThis session is best suited for participants who have some prior experience using R and are ready to expand their skills into statistical modeling.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Sahar is a PhD candidate in the Health Research Methodology program at McMaster University with a background in midwifery. She supports researchers in data analysis using statistical software such as R, SAS, and SPSS, research methodology, and evidence synthesis.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/linear-regression",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1752793204.png"
  },
  {
    "uid": "LibCal-7565-3919817",
    "title": "Establishing and Maintaining Researcher Profiles",
    "start": "2025-10-21T18:00:00.000Z",
    "end": "2025-10-21T19:00:00.000Z",
    "description": "The ability to effectively track and express your research impact is an essential skill for today’s researchers. Profile tools like ORCID, Google Scholar, and McMaster Experts provide a valuable space to showcase your research outputs (from publications to datasets to creative works) and enable efficient workflows for demonstrating your impact. This workshop will guide researchers through the process of creating and maintaining researcher profiles — from initial setup to streamlined upkeep and generating basic impact reports.\n\nBy the end of this workshop, participants will be able to:\n\n\n\tSelect the most appropriate research profile(s) for their needs.\n\tAutomate the initial population and maintenance of their research profile(s).\n\tGenerate basic research impact reports using profile data.\n\n\nThis session is ideal for researchers and graduate students interested in establishing an online presence and tracking the impact of their work.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: \n\nJack Young (he/him) is McMaster’s Research Impact Librarian, supporting the use of bibliometric data to enhance the reporting and strategic planning practices of the University’s academic departments, institutes, and researchers.\n\nSabrina Kirby (she/her) is the Research Technology Analyst for the McMaster Experts service, providing support to researchers and research administrations working with their Experts profiles and the varous systems and integrations that comprise McMaster Experts.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/researcher-profiles",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753390186.png"
  },
  {
    "uid": "LibCal-7565-3916872",
    "title": "Visualizing Networks with Gephi",
    "start": "2025-10-23T17:00:00.000Z",
    "end": "2025-10-23T18:00:00.000Z",
    "description": "Want to explore how people, ideas, or objects are connected? In this virtual workshop, you will learn how to use Gephi, a free and open-source tool designed for network visualization and analysis. We will focus on how graph data can help express relationships between entities, perfect for exploring everything from social networks to historical connections.\n\nIn this workshop, participants will learn to:\n\n\n\tImport a dataset into Gephi\n\tIdentify key network elements such as nodes and edges.\n\tApply basic layout algorithms (e.g., Force Atlas 2, Fruchterman Reingold)\n\tUtilize visual ranking tools (e.g., node size by degree, edge color by weight) to effectively explore and visualize network structures within Gephi.\n\n\nThis session is ideal for anyone curious about visualizing networks—no prior experience with Gephi or network analysis is required! It’s especially useful for humanities scholars interested in exploring relationships in texts, people, or historical data.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Subhanya (she/her) brings a background of research in data justice, science and technology studies, and environmental humanities. She is currently thinking through participatory data design which allow for visualizations that are empowering for the end user.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/gephi",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1752793808.png"
  },
  {
    "uid": "LibCal-7565-3918304",
    "title": "Creating Interactive Data Visualizations with Power BI",
    "start": "2025-11-13T18:00:00.000Z",
    "end": "2025-11-13T19:30:00.000Z",
    "description": "Want to turn your data into clear, compelling visuals? In this beginner-friendly workshop, you will learn how to use Power BI, a powerful tool for building interactive dashboards and charts. Power BI is freely available to McMaster users, making it a great option for coursework, research, and projects.\n\nIn this session, participants will learn to:\n\n Clean and prepare data\n\n Create impactful visualizations\n\n Explore accessibility and design best practices\n\n Build dashboards that tell your data story\n\nNo previous experience with Power BI is required! This session is great for anyone looking to build confidence in data visualization and make more informed decisions through clear, accessible design.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Subhanya (she/her) brings a background of research in data justice, science and technology studies, and environmental humanities. She is currently thinking through participatory data design which allow for visualizations that are empowering for the end user.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/DataPowerBI",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753210572.png"
  },
  {
    "uid": "LibCal-7565-3918338",
    "title": "Map Making for Absolute Beginners using QGIS",
    "start": "2025-11-18T18:30:00.000Z",
    "end": "2025-11-18T19:30:00.000Z",
    "description": "Interested in digital mapping, but unsure of where to start? This beginner-focused workshop introduces you to the fundamentals of geographic data and teaches you how to create digital maps using QGIS, a free and open-source geographic information system (GIS). QGIS is available free of charge to everyone, including current students, staff, and faculty at McMaster University. It’s a great starting point for anyone looking to explore mapping in their research, projects, or creative work.\n\nBy the end of this workshop, participants will be able to:\n\n\n\tDescribe what geographic data is and explain the basic functions of geographic information systems (GIS)\n\tIdentify and navigate the main components of the QGIS graphical user interface.\n\tAccess and use geospatial web services within QGIS.\n\tUnderstand the purpose of coordinate reference systems and apply them in QGIS.\n\tCreate a basic map layout using the QGIS print layout tool.\n\n\nAbsolutely no geography or quantitative background is necessary for an engaging experience. This session is great for beginners who are curious about mapping and want to explore how geographic data can be used to create digital maps with QGIS.\n\nDetails: Any preparatory work for the session can be found on its information page. This workshop will not be recorded.\n\nFacilitator Bio: Saman’s (she/her) work operates at the intersection of information science and critical geography. She’s particularly interested in the ways in which community-owned and -governed infrastructure can contribute to equitable knowledge systems. Currently, Saman takes care of McMaster’s Lloyd Reeds Map Collection, ensuring community members are able to access, understand, and use the collection for teaching and research.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/intro-qgis-1",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753216521.png"
  },
  {
    "uid": "LibCal-7565-3919047",
    "title": "Data Management Plan Bootcamp (Virtual)",
    "start": "2025-11-19T18:00:00.000Z",
    "end": "2025-11-19T21:00:00.000Z",
    "description": "Our popular DMP Bootcamp is back, reformatted into a hands-on online intensive for remote researchers on the go! Data Management Plans (DMPs) are both incredibly helpful research tools and increasingly required for grants but it can hard to know how to complete a Data Management Plan if it’s your first time. This session is carefully timed for researchers completing a CFI or Tri-Agency grant. If you're in the process of creating a DMP, either for a grant application or for your own research, join RDM Services for this afternoon session. The RDM Services team will provide tailored guidance as you write your plan online--we'll pop into your breakout rooms to make sure everything is going smoothy. Come away with a clear path forward or even a finished DMP!\n\nBy the end of this session, participants will be able to:\n\n\n\tIdentify the 5 key components of a data management plan (DMP).\n\tCompare strong and weak responses in each section of a DMP.\n\tDevelop a tailored outline, or potentially a complete draft, of their own DMP!\n\n\nThis participatory session is especially relevant for researchers at all levels in the beginning stages of a research project or streamlining best practices for their research team. Come on your own, send your research staff, or bring your whole research group. Let us know if you're joining as a research team - we'll make sure you get an online breakout room to work together in! Bring your own snacks to your desk and enjoy this dedicated time to work on your plan with extra support.\n\nDetails: Any preparatory work for the session can be found on its information page. This workshop will not be recorded.\n\nFacilitator Bio: \n\nDanica Evering (they/them) is a Research Data Management Specialist grounded in curiosity and a deep commitment to ethics. Danica is available to help students, postdocs, faculty, and staff with RDM through the data lifecycle—Data Management Plans, storage and backup, data security, data sharing. With an MA in Media Studies, Danica fosters active interest in RDM across disciplines, with a knack for engaging researchers who might not even realize they have data to manage. Outside of work they sing in a choir, play PC games, maintain an art writing practice, grow a garden, contribute Wikipedia articles, and run.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/dmp-bootcamp1",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753366659.png"
  },
  {
    "uid": "LibCal-7565-3919835",
    "title": "Creating Compelling Research Impact Visualizations",
    "start": "2025-11-19T19:00:00.000Z",
    "end": "2025-11-19T20:00:00.000Z",
    "description": "The ability to create effective visualizations of your research impact is a valuable skill when competing for grants, awards, and attention in a crowded research landscape. In this hands-on workshop, participants will create simple, eye-catching graphics to communicate impact from a variety of perspectives (from citation rates to collaboration networks to media attention).\n\nParticipants will learn how to:\n\n\n\tGenerate ready-made impact visualizations within a variety of bibliometric tools at McMaster.\n\tUtilize raw bibliometric data and custom templactes to create effective visualizations using Excel. - Effectively incorporate research impact visualizations into reports, grant applications, and award nominations.\n\n\nThis session is ideal for researchers, librarians, and graduate students interested in research metrics, scholarly communications, or mapping academic influence. No previous experience with data visualization is necessary.\n\nDetails: This workshop will not be recorded.\n\nFacilitator Bio: \n\nJack Young (he/him) is McMaster’s Research Impact Librarian, supporting the use of bibliometric data to enhance the reporting and strategic planning practices of the University’s academic departments, institutes, and researchers.",
    "location": "Sherman Centre for Digital Scholarship (1st Floor, Mills Library)",
    "url": "https://libcal.mcmaster.ca/calendar/scds/impact-viz",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753390791.png"
  },
  {
    "uid": "LibCal-7565-3918340",
    "title": "Modeling Binary Outcomes: Logistic Regression in R",
    "start": "2025-11-20T21:00:00.000Z",
    "end": "2025-11-20T22:00:00.000Z",
    "description": "Do you want to analyze outcomes like disease presence, voting behavior, or customer churn? Logistic regression is a powerful method for modeling binary outcomes and understanding how different factors influence the likelihood of an event. In this hands-on workshop, you’ll learn how to use R to build and interpret logistic regression models, helping you make informed decisions based on your data.\n\nThis workshop introduces logistic regression using R, with a focus on practical applications and interpretation. In this session, participants will:\n\n\n\t\n\tUnderstand foundational concepts of logistic regression\n\t\n\t\n\tLearn how to structure and prepare data for logistic regression analysis\n\t\n\t\n\tUse the glm() function in R to fit multiple logistic regression models\n\t\n\t\n\tInterpret model coefficients, including odds ratios\n\t\n\t\n\tEvaluate the performance and fit of logistic regression models\n\t\n\n\nThis session is ideal for participants who have some experience with R and are ready to explore statistical modeling in a supportive, practical setting. Attending the linear regression workshop or having prior familiarity with linear regression concepts will enhance your learning experience in this session, but it is not required.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: \n\nSahar is a PhD candidate in the Health Research Methodology program at McMaster University with a background in midwifery. She supports researchers in data analysis using statistical software such as R, SAS, and SPSS, research methodology, and evidence synthesis.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/logistic-regression",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753217396.png"
  },
  {
    "uid": "LibCal-7565-3919052",
    "title": "Data Management Plan Bootcamp (In-Person)",
    "start": "2025-11-25T18:00:00.000Z",
    "end": "2025-11-25T21:00:00.000Z",
    "description": "Let us be your body double with this in-person bootcamp! Data Management Plans (DMPs) are both incredibly helpful research tools and increasingly required for grants but it can hard to know how to complete a Data Management Plan if it’s your first time. This session is carefully timed for researchers completing a CFI or Tri-Agency grant this fall. If you're in the process of creating a DMP, either for a grant application or for your own research, join RDM Services for this afternoon session. The RDM services team will provide tailored guidance as you write your plan on site, and we'll have some light snacks and refreshments to keep you going. Come away with a clear path forward or even a finished DMP!\n\nBy the end of this session, participants will be able to:\n\n\n\tIdentify the 5 key components of a data management plan (DMP).\n\tCompare strong and weak responses in each section of a DMP.\n\tDevelop a tailored outline, or potentially a complete draft, of their own DMP!\n\n\nThis participatory session is especially relevant for researchers at all levels in the beginning stages of a research project or streamlining best practices for their research team. Come on your own, send your research staff, or bring your whole research group. Let us know if you're joining as a research team - we'll make sure you get a table to work together at!\n\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Isaac Pratt (he/him) is a research scientist by training and has a PhD in Anatomy & Cell Biology. He leverages nearly a decade of interdisciplinary research experience to help support students, staff, and faculty. His expertise lies in questions surrounding data storage, security, planning, archival, and sharing. Isaac also provides support and curation services for McMaster Dataverse. His other interests include reproducible research methods, open science, and data science.",
    "location": "Sherman Centre for Digital Scholarship (1st Floor, Mills Library)",
    "url": "https://libcal.mcmaster.ca/calendar/scds/dmp-bootcamp2",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753380398.png"
  },
  {
    "uid": "LibCal-7565-3918358",
    "title": "Creating and Sharing Maps using ArcGIS Online",
    "start": "2025-11-27T15:30:00.000Z",
    "end": "2025-11-27T16:30:00.000Z",
    "description": "Want to bring your data to life through interactive maps? This beginner-friendly workshop introduces the fundamentals of Geographic Information Systems (GIS) and geospatial data before guiding you step-by-step through creating your own interactive web map using ArcGIS Online. Perfect for beginners, this session combines essential theory with hands-on practice to help you confidently start mapping online. ArcGIS Online is available free of charge to current students, staff, and faculty at McMaster University for coursework and research.\n\nBy the end of the workshop, participants will be able to:\n\n\n\tExplain key concepts of Geographic Information Systems (GIS) and recognize various real-world applications.\n\tIdentify and access reliable sources of geospatial data for mapping projects.\n\tCreate a simple, functional map using ArcGIS Online by applying the skills learned during the workshop.\n\n\nNo prior experience is needed! This session is perfect for beginners interested in mapping who want to learn how to work with geographic data and create digital maps using ArcGIS Online.\n\nDetails: Any preparatory work for the session can be found on its information page. This workshop will not be recorded.\n\nFacilitator Bio: Christine Homuth (she/her) is the Library's GIS Specialist, providing support and resources to students, researchers, and faculty members working with Geographic Information Systems (GIS) and geospatial data.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/arcgis-online",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753218556.png"
  },
  {
    "uid": "LibCal-7565-3919685",
    "title": "Best Practices for Managing Data in your Research",
    "start": "2026-01-14T15:30:00.000Z",
    "end": "2026-01-14T16:30:00.000Z",
    "description": "TIFU (Today I F'ed Up) by losing a ton of data for my research - Have you ever seen a description like this on Reddit? Are your desktop and downloads folders a jumble of files named Data-finalFINAL-USETHISONE? Is all of your lab's data stored on a single drive located conveniently under a sprinkler system? Join research data management services and learn how investing a small amount of time in organizing your data now can save you a lot of time and prevent future headaches. In this introductory workshop, learn about research data management best practices. We will go over best practices for data planning, storage, organization, preservation, and sharing.\n\nBy the end of the session, participants will be empowered to:\n\n\n\tProduce a plan for their data\n\tOrganize and document their data consistently\n\tStore and back-up their data securely,\n\tSelect an appropriate data repository for archival and sharing.\n\n\nNo prior experience with data management is required! This session is perfect for anyone who wants to feel more confident organizing, storing, and sharing their data in clear and practical ways.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: \n\nIsaac Pratt (he/him) is a research scientist by training and has a PhD in Anatomy & Cell Biology. He leverages nearly a decade of interdisciplinary research experience to help support students, staff, and faculty. His expertise lies in questions surrounding data storage, security, planning, archival, and sharing. Isaac also provides support and curation services for McMaster Dataverse. His other interests include reproducible research methods, open science, and data science.\n\nDanica Evering holds expansive experience with research support, education, project management, advocacy, and knowledge translation; with fluency in social practice art, healthcare, community research, data, and systems development. Danica supports students, postdocs, faculty, and staff with RDM through the data lifecycle—Data Management Plans, storage and backup, data security, data sharing. With an MA in Media Studies from Concordia, they are interested in fostering RDM within curious scholars and disciplines.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/intro-rdm2",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753381862.png"
  },
  {
    "uid": "LibCal-7565-3919873",
    "title": "Map Making for Absolute Beginners using QGIS",
    "start": "2026-01-20T18:30:00.000Z",
    "end": "2026-01-20T19:30:00.000Z",
    "description": "Interested in digital mapping, but unsure of where to start? This beginner-focused workshop introduces you to the fundamentals of geographic data and teaches you how to create digital maps using QGIS, a free and open-source geographic information system (GIS). QGIS is available free of charge to everyone, including current students, staff, and faculty at McMaster University. It’s a great starting point for anyone looking to explore mapping in their research, projects, or creative work.\n\nBy the end of this workshop, participants will be able to:\n\n\n\tDescribe what geographic data is and explain the basic functions of geographic information systems (GIS).\n\tIdentify and navigate the main components of the QGIS graphical user interface.\n\tAccess and use geospatial web services within QGIS.\n\tUnderstand the purpose of coordinate reference systems and apply them in QGIS.\n\tCreate a basic map layout using the QGIS print layout tool.\n\n\nAbsolutely no geography or quantitative background is necessary for an engaging experience. This session is great for beginners who are curious about mapping and want to explore how geographic data can be used to create digital maps with QGIS.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Saman’s (she/her) work operates at the intersection of information science and critical geography. She’s particularly interested in the ways in which community-owned and -governed infrastructure can contribute to equitable knowledge systems. Currently, Saman takes care of McMaster’s Lloyd Reeds Map Collection, ensuring community members are able to access, understand, and use the collection for teaching and research.",
    "location": "Sherman Centre for Digital Scholarship (1st Floor, Mills Library)",
    "url": "https://libcal.mcmaster.ca/calendar/scds/intro-qgis-2",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753391361.png"
  },
  {
    "uid": "LibCal-7565-3919883",
    "title": "Tracking the Impact of Non-Traditional Research Outputs",
    "start": "2026-01-21T16:00:00.000Z",
    "end": "2026-01-21T17:00:00.000Z",
    "description": "From datasets and code to podcasts, reports, and performances, not all research outputs take the form of journal articles or books. These are known as Non-Traditional Research Outputs (NTROs)—scholarly or creative works that fall outside conventional academic publishing. While NTROs make up a significant and growing part of research activity, they are often under-recognized in systems that track and assess research impact. In this webinar, participants will explore current best practices for tracking and expressing the impact of NTROs and learn how these practices align with movements, like the San Francisco Declaration on Research Assessment (DORA), advocating for more responsible research assessment.\n\nParticipants will learn how to:\n\n\n\tCreate persistent identifiers (e.g. DOIs) and metadata records for NTROs.\n\tIncorporate NTROs into existing researcher profile systems (e.g. ORCiD; McMaster Experts).\n\tCommunicate the value of NTROs to responsible research assessment practices.\n\n\nThis session is ideal for researchers, creators, and academic staff working with non-traditional outputs who want to make their work more visible, trackable, and valued.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: \n\nJack Young (he/him) is McMaster’s Research Impact Librarian, supporting the use of bibliometric data to enhance the reporting and strategic planning practices of the University’s academic departments, institutes, and researchers.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/ntros",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753392047.png"
  },
  {
    "uid": "LibCal-7565-3919894",
    "title": "Streamline Your Research Materials Photos",
    "start": "2026-01-27T18:00:00.000Z",
    "end": "2026-01-27T19:00:00.000Z",
    "description": "You've been there--getting home from an incredible research trip to an archive, maps collection, or gallery only to face down thousands of photos all labelled \"IMG50293.png.\" Join Research Data Management Specialist Danica Evering and Data Analysis and Visualization Librarian Subhanya Sivajothy for an overview of Tropy: a free and open-source solution to explore and manage research photos. In this webinar, you will learn how to use Tropy to zoom into details, tag and organize content with metadata, and begin uncovering patterns across your sources. We will also explore how Tropy connects with Zotero for reference management and Omeka for building digital exhibits, offering a full workflow from research to public presentation.\n\nIn this hands-on workshop, participants will learn to:\n\n\n\tUse Tropy to organize, annotate, analyze and manage research materials image collections.\n\tSelect appropriate metadata and implement documentation and tagging systems.\n\tIntegrate Tropy with Zotero and Omeka to cite archival sources and enhance the impact of your research and digital exhibitions.\n\n\nNo prior knowledge of the software will be required but please come with a version of the software downloaded for the demo! We'll be doing some hands-on experimentation with the software to get you familiar with these tools.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: \n\nDanica Evering holds broad experience with research support, education, project management, advocacy, and knowledge translation; with fluency in social practice art, healthcare, community research, data, and systems development. Danica supports students, postdocs, faculty, and staff with RDM through the data lifecycle—Data Management Plans, storage and backup, data security, data sharing. With an MA in Media Studies from Concordia, they are interested in fostering RDM within curious scholars and disciplines.\n\nSubhanya Sivajothy (she/her) brings a background of research in data justice, science and technology studies, and environmental humanities. She is currently thinking through participatory data design which allow for visualizations that are empowering for the end user.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/tropy",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753392711.png"
  }
]