[
  {
    "uid": "LibCal-7565-3916870",
    "title": "Best Practices for Managing Data in your Research",
    "start": "2025-10-01T10:30:00 EDT",
    "end": "2025-10-01T11:30:00 EDT",
    "description": "TIFU (Today I F'ed Up) by losing a ton of data for my research - Have you ever seen a description like this on Reddit? Are your desktop and downloads folders a jumble of files named Data-finalFINAL-USETHISONE? Is all of your lab's data stored on a single drive located conveniently under a sprinkler system? Join research data management services and learn how investing a small amount of time in organizing your data now can save you a lot of time and prevent future headaches. In this introductory workshop, learn about research data management best practices. We will go over best practices for data planning, storage, organization, preservation, and sharing.\n\nBy the end of the session, participants will be empowered to:\n\n\n\tProduce a plan for their data\n\tOrganize and document their data consistently\n\tStore and back-up their data securely\n\tSelect an appropriate data repository for archival and sharing\n\n\nNo prior experience with data management is required! This session is perfect for anyone who wants to feel more confident organizing, storing, and sharing their data in clear and practical ways.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded. The recording will be posted to the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: \n\nIsaac Pratt (he/him) is a research scientist by training and has a PhD in Anatomy & Cell Biology. He leverages nearly a decade of interdisciplinary research experience to help support students, staff, and faculty. His expertise lies in questions surrounding data storage, security, planning, archival, and sharing. Isaac also provides support and curation services for McMaster Dataverse. His other interests include reproducible research methods, open science, and data science.\n\nDanica Evering holds expansive experience with research support, education, project management, advocacy, and knowledge translation; with fluency in social practice art, healthcare, community research, data, and systems development. Danica supports students, postdocs, faculty, and staff with RDM through the data lifecycle—Data Management Plans, storage and backup, data security, data sharing. With an MA in Media Studies from Concordia, they are interested in fostering RDM within curious scholars and disciplines.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. It is also eligible for the Canadian Certificate for Digital Humanities. To learn more, visit ccdhhn.ca or contact scds@mcmaster.ca.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/intro-rdm1",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1752792088.png"
  },
  {
    "uid": "LibCal-7565-3920117",
    "title": "Visions of Generative AI: Historical and Ethical Dimensions of Visual Media Literacy in the Era of AI",
    "start": "2025-10-08T10:30:00 EDT",
    "end": "2025-10-08T12:00:00 EDT",
    "description": "Whether you regularly engage with visual generative AI or are just dipping your toe into these waters, this workshop focuses on recognizing sources of image biases and its impacts and implications as artificial images become increasingly sophisticated and ubiquitous. Applying a combined historical and ethics lens, workshop participants will have the opportunity to generate and analyze artificial images as a means of unpacking continuity and changes in visual practices and norms. The workshop supports the development of critical reflection skills and tools for creating and ‘reading’ images that avoid potential pitfalls of (re)producing harmful clichés and to support identification of mis/disinformation. The workshop has relevance for academic integrity along with navigating our daily visual landscape, which in turn has implications for democracy, civic engagement, and human relationships. At a time when visual evidence/truth, dis/misinformation and academic integrity are at stake, there is no time like the present to gain a solid foundation on visual literacy.\n\nBy the end of the workshop, participants will be able to:\n\n\n\tIdentify opportunities, pitfalls and potential harms of visual generative AI to make informed decisions on its use in educational and every-day life settings by exploring recent examples.\n\tUnpack the role of audience engagement with visual images in the era of AI to critically analyse the impacts of and to support responsible use of this new technology.\n\tTrace biases and ethically problematic visual stereotypes present in AI-generated images through comparison and critical reflection of historical cases\n\n\nThis workshop is great for students, educators, researchers, and professionals interested in developing critical visual literacy skills to responsibly engage with AI-generated images in academic, creative, or everyday contexts!\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: \n\nDr. Sonya de Laat is the Academic Program Advisor and Curriculum Coordinator in the School of Global Health and Social Medicine, and a Research Associate with the Department of Health Research Methods, Evidence, and Impact at McMaster University. With degrees in Anthropology and Media Studies, Dr. de Laat’s work has focused on historical and ethical dimensions of humanitarian visual culture and action. Currently, her focus is on challenging the promises/hopes of photorealistic generative AI and sharing diverse visual histories as a corrective intervention. Her postdoctoral work focused on moral and practical dimensions of palliative care in refugee camps drawing attention to small interventions having big impacts, and the importance of co-design and partnered research. Dr. de Laat is an active member of the Humanitarian Health Ethics research group, and the Canadian Network on Humanitarian History. Representative publications include, “Assembling a global health image: Ethical and pragmatic tensions through the lenses of photographers” (PLOS Glob Public Health 2024), “A case analysis of partnered research on palliative care for refugees in Jordan and Rwanda” (Confl Health 2021), and “The Camera and the Red Cross: ‘Lamentable pictures’ and Conflict Photography Bring into Focus an International Movement, 1855-1865” (IRRC 2021).\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. It is also eligible for the Canadian Certificate for Digital Humanities. To learn more, visit ccdhhn.ca or contact scds@mcmaster.ca.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": "Sherman Centre for Digital Scholarship (1st Floor, Mills Library)",
    "url": "https://libcal.mcmaster.ca/calendar/scds/ai-visions",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753416972.png"
  },
  {
    "uid": "LibCal-7565-3916871",
    "title": "Getting Started with Linear Regression in R",
    "start": "2025-10-09T16:00:00 EDT",
    "end": "2025-10-09T17:00:00 EDT",
    "description": "Curious about uncovering patterns in your data? Whether you're investigating how income relates to education or how age and location affect voting behaviour, linear regression helps quantify and interpret relationships between variables.\n\nThis hands-on, intermediate-level workshop introduces linear modeling in R, a powerful and open-source tool for statistical analysis. You’ll learn how to fit a linear model, interpret coefficients, assess model assumptions, and evaluate model performance using diagnostic plots like residuals.\n\nBy the end of this session, participants will be able to:\n\n\n\t\n\tFit a linear regression model using R\n\t\n\t\n\tInterpret key output from a linear model\n\t\n\t\n\tCheck model assumptions and explore diagnostic plots\n\t\n\t\n\tApply linear modeling techniques to real-world data\n\t\n\n\nThis session is best suited for participants who have some prior experience using R and are ready to expand their skills into statistical modeling.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Sahar is a PhD candidate in the Health Research Methodology program at McMaster University with a background in midwifery. She supports researchers in data analysis using statistical software such as R, SAS, and SPSS, research methodology, and evidence synthesis.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. \n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/linear-regression",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1752793204.png"
  },
  {
    "uid": "LibCal-7565-3920831",
    "title": "Introduction to R Programming",
    "start": "2025-10-16T13:30:00 EDT",
    "end": "2025-10-16T15:30:00 EDT",
    "description": "Curious about R but not sure where to start? This beginner-friendly workshop is designed for those with no prior experience in R programming. You’ll get hands-on with RStudio, explore key data types and data structures, and learn how to perform basic data manipulation. By the end, you’ll be able to write and run your own R scripts with confidence.\n\nThis session will take place synchronously and will be recorded and shared publicly for future reference.\n\nIn the workshop, participants will learn to:\n\n\n\tNavigate the RStudio environment\n\tUnderstand and use basic data types and structures in R\n\tWrite and run simple R scripts\n\tPerform basic data manipulation tasks\n\n\nWhether you're working with data in the sciences, humanities, or social sciences, this workshop offers a strong foundation to begin your R programming journey.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: \n\nVivek Jadon (he/him) provides research support in the use of numeric research data. As part of his role, Vivek is McMaster University’s official representative for Statistics Canada’s Data Liberation Initiative (DLI) program and Inter-university Consortium for Political and Social Research (ICPSR). Both of these programs provide researchers with vast archive of research data from various disciplines for high quality research and instruction. Vivek is also involved in building awareness and promoting RDM activities/services at McMaster.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. \n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/intro-r",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753708661.png"
  },
  {
    "uid": "LibCal-7565-3919817",
    "title": "Establishing and Maintaining Researcher Profiles",
    "start": "2025-10-21T14:00:00 EDT",
    "end": "2025-10-21T15:00:00 EDT",
    "description": "The ability to effectively track and express your research impact is an essential skill for today’s researchers. Profile tools like ORCID, Google Scholar, and McMaster Experts provide a valuable space to showcase your research outputs (from publications to datasets to creative works) and enable efficient workflows for demonstrating your impact. This workshop will guide researchers through the process of creating and maintaining researcher profiles — from initial setup to streamlined upkeep and generating basic impact reports.\n\nBy the end of this workshop, participants will be able to:\n\n\n\tSelect the most appropriate research profile(s) for their needs.\n\tAutomate the initial population and maintenance of their research profile(s).\n\tGenerate basic research impact reports using profile data.\n\n\nThis session is ideal for researchers and graduate students interested in establishing an online presence and tracking the impact of their work.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: \n\nJack Young (he/him) is McMaster’s Research Impact Librarian, supporting the use of bibliometric data to enhance the reporting and strategic planning practices of the University’s academic departments, institutes, and researchers.\n\nSabrina Kirby (she/her) is the Research Technology Analyst for the McMaster Experts service, providing support to researchers and research administrations working with their Experts profiles and the varous systems and integrations that comprise McMaster Experts.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. It is also eligible for the Canadian Certificate for Digital Humanities. To learn more, visit ccdhhn.ca or contact scds@mcmaster.ca.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/researcher-profiles",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753390186.png"
  },
  {
    "uid": "LibCal-7565-3916872",
    "title": "Visualizing Networks with Gephi",
    "start": "2025-10-23T13:00:00 EDT",
    "end": "2025-10-23T14:00:00 EDT",
    "description": "Want to explore how people, ideas, or objects are connected? In this virtual workshop, you will learn how to use Gephi, a free and open-source tool designed for network visualization and analysis. We will focus on how graph data can help express relationships between entities, perfect for exploring everything from social networks to historical connections.\n\nIn this workshop, participants will learn to:\n\n\n\tImport a dataset into Gephi\n\tIdentify key network elements such as nodes and edges.\n\tApply basic layout algorithms (e.g., Force Atlas 2, Fruchterman Reingold)\n\tUtilize visual ranking tools (e.g., node size by degree, edge color by weight) to effectively explore and visualize network structures within Gephi.\n\n\nThis session is ideal for anyone curious about visualizing networks—no prior experience with Gephi or network analysis is required! It’s especially useful for humanities scholars interested in exploring relationships in texts, people, or historical data.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Subhanya (she/her) brings a background of research in data justice, science and technology studies, and environmental humanities. She is currently thinking through participatory data design which allow for visualizations that are empowering for the end user.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/gephi",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753972674.png"
  },
  {
    "uid": "LibCal-7565-3920874",
    "title": "Creating High-Quality Documents with LaTeX",
    "start": "2025-10-23T14:00:00 EDT",
    "end": "2025-10-23T15:30:00 EDT",
    "description": "Want more control over how your documents look and function? LaTeX is an open-source typesetting system used to create clean, consistent, and professional documents. It’s especially helpful for working with complex formatting, citations, or mathematical content, and it's a powerful tool for writing reports, articles, and long-form texts in any discipline.\n\nIn this beginner-friendly workshop, you’ll learn the building blocks of LaTeX, including how to format text, structure a document, and write equations. You’ll also walk through the process of creating your first LaTeX document from scratch.\n\nBy the end of this session, participants will be able to:\n\n\n\tIdentify the basic structure and purpose of LaTeX documents\n\tFormat text and write mathematical equations using LaTeX commands\n\tCreate and compile a basic LaTeX document\n\n\nThis session is ideal for students, researchers, and writers in any field who want to explore LaTeX as a powerful alternative to traditional word processors—no prior experience required.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: John Fink is the Digital Scholarship Librarian in the Sherman Centre.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. It is also eligible for the Canadian Certificate for Digital Humanities. To learn more, visit ccdhhn.ca or contact scds@mcmaster.ca.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/intro-latex",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753711419.png"
  },
  {
    "uid": "LibCal-7565-3920834",
    "title": "Introduction to Data Analysis with SPSS",
    "start": "2025-10-30T13:30:00 EDT",
    "end": "2025-10-30T15:30:00 EDT",
    "description": "Looking for an accessible way to analyze data? SPSS is a widely used statistical software that makes it easy to explore, summarize, and interpret data—no programming required.\n\nThis beginner-friendly workshop introduces SPSS through hands-on activities using its point-and-click interface. You’ll learn how to import data, run basic descriptive statistics, and perform simple analyses like t-tests and correlations.\n\nBy the end of this session, participants will be able to:\n\n\n\tNavigate the SPSS interface and load data\n\tRun descriptive statistics such as means, frequencies, and standard deviations\n\tConduct basic statistical tests (e.g., t-tests, correlations)\n\tInterpret and export results from SPSS\n\n\nThis session is ideal for students, researchers, and staff who want a user-friendly introduction to statistical analysis. No prior experience required!\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: \n\nVivek Jadon (he/him) provides research support in the use of numeric research data. As part of his role, Vivek is McMaster University’s official representative for Statistics Canada’s Data Liberation Initiative (DLI) program and Inter-university Consortium for Political and Social Research (ICPSR). Both of these programs provide researchers with vast archive of research data from various disciplines for high quality research and instruction. Vivek is also involved in building awareness and promoting RDM activities/services at McMaster.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/intro-spss",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753710235.png"
  },
  {
    "uid": "LibCal-7565-3918304",
    "title": "Creating Interactive Data Visualizations with Power BI",
    "start": "2025-11-06T13:00:00 EST",
    "end": "2025-11-06T14:30:00 EST",
    "description": "Want to turn your data into clear, compelling visuals? In this beginner-friendly workshop, you will learn how to use Power BI, a powerful tool for building interactive dashboards and charts. Power BI is freely available to McMaster users, making it a great option for coursework, research, and projects.\n\nIn this session, participants will learn to:\n\n Clean and prepare data\n\n Create impactful visualizations\n\n Explore accessibility and design best practices\n\n Build dashboards that tell your data story\n\nNo previous experience with Power BI is required! This session is great for anyone looking to build confidence in data visualization and make more informed decisions through clear, accessible design.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Subhanya (she/her) brings a background of research in data justice, science and technology studies, and environmental humanities. She is currently thinking through participatory data design which allow for visualizations that are empowering for the end user.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/DataPowerBI",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753716554.png"
  },
  {
    "uid": "LibCal-7565-3920908",
    "title": "Introduction to Python Programming",
    "start": "2025-11-13T13:30:00 EST",
    "end": "2025-11-13T15:30:00 EST",
    "description": "Interested in learning one of the world’s most popular programming languages? Python is beginner-friendly and widely used across many fields for data analysis, automation, and more.\n\nThis hands-on workshop will introduce you to Python’s basic concepts, including data types, variables, and simple operations on numbers and strings. No prior experience with Python is needed.\n\nBy the end of this session, participants will be able to:\n\n\n\tUnderstand fundamental Python data types and variables\n\tPerform basic operations on numbers and strings\n\tWrite simple Python code to manipulate and store data\n\n\nThis session will be recorded and made publicly available. It’s perfect for anyone looking for a practical introduction to Python programming.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: \n\nVivek Jadon (he/him) provides research support in the use of numeric research data. As part of his role, Vivek is McMaster University’s official representative for Statistics Canada’s Data Liberation Initiative (DLI) program and Inter-university Consortium for Political and Social Research (ICPSR). Both of these programs provide researchers with vast archive of research data from various disciplines for high quality research and instruction. Vivek is also involved in building awareness and promoting RDM activities/services at McMaster.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. \n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/intro-python",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753714709.png"
  },
  {
    "uid": "LibCal-7565-3918338",
    "title": "Map Making for Absolute Beginners using QGIS",
    "start": "2025-11-18T13:30:00 EST",
    "end": "2025-11-18T14:30:00 EST",
    "description": "Interested in digital mapping, but unsure of where to start? This beginner-focused workshop introduces you to the fundamentals of geographic data and teaches you how to create digital maps using QGIS, a free and open-source geographic information system (GIS). QGIS is available free of charge to everyone, including current students, staff, and faculty at McMaster University. It’s a great starting point for anyone looking to explore mapping in their research, projects, or creative work.\n\nBy the end of this workshop, participants will be able to:\n\n\n\tDescribe what geographic data is and explain the basic functions of geographic information systems (GIS)\n\tIdentify and navigate the main components of the QGIS graphical user interface.\n\tAccess and use geospatial web services within QGIS.\n\tUnderstand the purpose of coordinate reference systems and apply them in QGIS.\n\tCreate a basic map layout using the QGIS print layout tool.\n\n\nAbsolutely no geography or quantitative background is necessary for an engaging experience. This session is great for beginners who are curious about mapping and want to explore how geographic data can be used to create digital maps with QGIS.\n\nDetails: Any preparatory work for the session can be found on its information page. This workshop will not be recorded.\n\nFacilitator Bio: Saman’s (she/her) work operates at the intersection of information science and critical geography. She’s particularly interested in the ways in which community-owned and -governed infrastructure can contribute to equitable knowledge systems. Currently, Saman takes care of McMaster’s Lloyd Reeds Map Collection, ensuring community members are able to access, understand, and use the collection for teaching and research.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. \n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/intro-qgis-1",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753216521.png"
  },
  {
    "uid": "LibCal-7565-3919047",
    "title": "Data Management Plan Bootcamp (Virtual)",
    "start": "2025-11-19T13:00:00 EST",
    "end": "2025-11-19T16:00:00 EST",
    "description": "Our popular DMP Bootcamp is back, reformatted into a hands-on online intensive for remote researchers on the go! Data Management Plans (DMPs) are both incredibly helpful research tools and increasingly required for grants but it can hard to know how to complete a Data Management Plan if it’s your first time. If you're in the process of creating a DMP, either for a grant application or for your own research, join RDM Services for this afternoon session. The RDM Services team will provide tailored guidance as you write your plan online--we'll pop into your breakout rooms to make sure everything is going smoothy. Come away with a clear path forward or even a finished DMP!\n\nBy the end of this session, participants will be able to:\n\n\n\tIdentify the 5 key components of a data management plan (DMP).\n\tCompare strong and weak responses in each section of a DMP.\n\tDevelop a tailored outline, or potentially a complete draft, of their own DMP!\n\n\nThis participatory session is especially relevant for researchers at all levels in the beginning stages of a research project or streamlining best practices for their research team. Come on your own, send your research staff, or bring your whole research group. Let us know if you're joining as a research team - we'll make sure you get an online breakout room to work together in! Bring your own snacks to your desk and enjoy this dedicated time to work on your plan with extra support.\n\nDetails: Any preparatory work for the session can be found on its information page. This workshop will not be recorded.\n\nFacilitator Bio: Danica Evering (they/them) is a Research Data Management Specialist grounded in curiosity and a deep commitment to ethics. Danica is available to help students, postdocs, faculty, and staff with RDM through the data lifecycle—Data Management Plans, storage and backup, data security, data sharing. With an MA in Media Studies, Danica fosters active interest in RDM across disciplines, with a knack for engaging researchers who might not even realize they have data to manage. Outside of work they sing in a choir, play PC games, maintain an art writing practice, grow a garden, contribute Wikipedia articles, and run.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. It is also eligible for the Canadian Certificate for Digital Humanities. To learn more, visit ccdhhn.ca or contact scds@mcmaster.ca.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/dmp-bootcamp1",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753974179.png"
  },
  {
    "uid": "LibCal-7565-3919835",
    "title": "Creating Compelling Research Impact Visualizations",
    "start": "2025-11-19T14:00:00 EST",
    "end": "2025-11-19T15:00:00 EST",
    "description": "The ability to create effective visualizations of your research impact is a valuable skill when competing for grants, awards, and attention in a crowded research landscape. In this hands-on workshop, participants will create simple, eye-catching graphics to communicate impact from a variety of perspectives (from citation rates to collaboration networks to media attention).\n\nParticipants will learn how to:\n\n\n\tGenerate ready-made impact visualizations within a variety of bibliometric tools at McMaster.\n\tUtilize raw bibliometric data and custom templactes to create effective visualizations using Excel. - Effectively incorporate research impact visualizations into reports, grant applications, and award nominations.\n\n\nThis session is ideal for researchers, librarians, and graduate students interested in research metrics, scholarly communications, or mapping academic influence. No previous experience with data visualization is necessary.\n\nDetails: Any preparatory work for the session can be found on its information page. This workshop will not be recorded.\n\nFacilitator Bio: Jack Young (he/him) is McMaster’s Research Impact Librarian, supporting the use of bibliometric data to enhance the reporting and strategic planning practices of the University’s academic departments, institutes, and researchers.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. It is also eligible for the Canadian Certificate for Digital Humanities. To learn more, visit ccdhhn.ca or contact scds@mcmaster.ca.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": "Sherman Centre for Digital Scholarship (1st Floor, Mills Library)",
    "url": "https://libcal.mcmaster.ca/calendar/scds/impact-viz",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753390791.png"
  },
  {
    "uid": "LibCal-7565-3918340",
    "title": "Modeling Binary Outcomes: Logistic Regression in R",
    "start": "2025-11-20T16:00:00 EST",
    "end": "2025-11-20T17:00:00 EST",
    "description": "Do you want to analyze outcomes like disease presence, voting behavior, or customer churn? Logistic regression is a powerful method for modeling binary outcomes and understanding how different factors influence the likelihood of an event. In this hands-on workshop, you’ll learn how to use R to build and interpret logistic regression models, helping you make informed decisions based on your data.\n\nThis workshop introduces logistic regression using R, with a focus on practical applications and interpretation. In this session, participants will:\n\n\n\t\n\tUnderstand foundational concepts of logistic regression\n\t\n\t\n\tLearn how to structure and prepare data for logistic regression analysis\n\t\n\t\n\tUse the glm() function in R to fit multiple logistic regression models\n\t\n\t\n\tInterpret model coefficients, including odds ratios\n\t\n\t\n\tEvaluate the performance and fit of logistic regression models\n\t\n\n\nThis session is ideal for participants who have some experience with R and are ready to explore statistical modeling in a supportive, practical setting. Attending the linear regression workshop or having prior familiarity with linear regression concepts will enhance your learning experience in this session, but it is not required.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Sahar is a PhD candidate in the Health Research Methodology program at McMaster University with a background in midwifery. She supports researchers in data analysis using statistical software such as R, SAS, and SPSS, research methodology, and evidence synthesis.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. \n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/logistic-regression",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753217396.png"
  },
  {
    "uid": "LibCal-7565-3919052",
    "title": "Data Management Plan Bootcamp (In-Person)",
    "start": "2025-11-25T13:00:00 EST",
    "end": "2025-11-25T16:00:00 EST",
    "description": "Let us be your body double with this in-person bootcamp! Data Management Plans (DMPs) are both incredibly helpful research tools and increasingly required for grants but it can hard to know how to complete a Data Management Plan if it’s your first time. If you're in the process of creating a DMP, either for a grant application or for your own research, join RDM Services for this afternoon session. The RDM services team will provide tailored guidance as you write your plan on site, and we'll have some light snacks and refreshments to keep you going. Come away with a clear path forward or even a finished DMP!\n\nBy the end of this session, participants will be able to:\n\n\n\tIdentify the 5 key components of a data management plan (DMP).\n\tCompare strong and weak responses in each section of a DMP.\n\tDevelop a tailored outline, or potentially a complete draft, of their own DMP!\n\n\nThis participatory session is especially relevant for researchers at all levels in the beginning stages of a research project or streamlining best practices for their research team. Come on your own, send your research staff, or bring your whole research group. Let us know if you're joining as a research team - we'll make sure you get a table to work together at!\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Isaac Pratt (he/him) is a research scientist by training and has a PhD in Anatomy & Cell Biology. He leverages nearly a decade of interdisciplinary research experience to help support students, staff, and faculty. His expertise lies in questions surrounding data storage, security, planning, archival, and sharing. Isaac also provides support and curation services for McMaster Dataverse. His other interests include reproducible research methods, open science, and data science.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. It is also eligible for the Canadian Certificate for Digital Humanities. To learn more, visit ccdhhn.ca or contact scds@mcmaster.ca.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": "Sherman Centre for Digital Scholarship (1st Floor, Mills Library)",
    "url": "https://libcal.mcmaster.ca/calendar/scds/dmp-bootcamp2",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753380398.png"
  },
  {
    "uid": "LibCal-7565-3920907",
    "title": "Making and Querying Databases in SQL with DuckDB",
    "start": "2025-11-26T14:00:00 EST",
    "end": "2025-11-26T15:30:00 EST",
    "description": "Want to work with structured data more efficiently? SQL (Structured Query Language) is a powerful tool for managing and analyzing data and it’s easier to get started than you might think.\n\nThis beginner-friendly workshop introduces SQL using DuckDB, a lightweight, cross-platform database that runs locally and requires no setup. Through hands-on practice, you’ll learn how to create a database, add data to it, and write queries to find the information you need.\n\nBy the end of this session, participants will be able to:\n\n\n\tUnderstand the basic structure and purpose of SQL\n\tCreate and populate a DuckDB database\n\tWrite and run basic SQL queries to explore and extract data\n\n\nThis session is ideal for beginners in data analysis, researchers, and students who want a gentle introduction to databases using a simple and powerful tool. No prior experience required!\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: John Fink is the Digital Scholarship Librarian in the Sherman Centre.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. It is also eligible for the Canadian Certificate for Digital Humanities. To learn more, visit ccdhhn.ca or contact scds@mcmaster.ca.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/sql-duckdb",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753716576.png"
  },
  {
    "uid": "LibCal-7565-3918358",
    "title": "Creating and Sharing Maps using ArcGIS Online",
    "start": "2025-11-27T10:30:00 EST",
    "end": "2025-11-27T11:30:00 EST",
    "description": "Want to bring your data to life through interactive maps? This beginner-friendly workshop introduces the fundamentals of Geographic Information Systems (GIS) and geospatial data before guiding you step-by-step through creating your own interactive web map using ArcGIS Online. Perfect for beginners, this session combines essential theory with hands-on practice to help you confidently start mapping online. ArcGIS Online is available free of charge to current students, staff, and faculty at McMaster University for coursework and research.\n\nBy the end of the workshop, participants will be able to:\n\n\n\tExplain key concepts of Geographic Information Systems (GIS) and recognize various real-world applications.\n\tIdentify and access reliable sources of geospatial data for mapping projects.\n\tCreate a simple, functional map using ArcGIS Online by applying the skills learned during the workshop.\n\n\nNo prior experience is needed! This session is perfect for beginners interested in mapping who want to learn how to work with geographic data and create digital maps using ArcGIS Online.\n\nDetails: Any preparatory work for the session can be found on its information page. This workshop will not be recorded.\n\nFacilitator Bio: Christine Homuth (she/her) is the Library's GIS Specialist, providing support and resources to students, researchers, and faculty members working with Geographic Information Systems (GIS) and geospatial data.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. \n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/arcgis-online",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1754067181.png"
  },
  {
    "uid": "LibCal-7565-3920839",
    "title": "Microdata Analysis with Python using Statistics Canada Data",
    "start": "2025-11-27T13:30:00 EST",
    "end": "2025-11-27T15:30:00 EST",
    "description": "Interested in working with Canadian survey data? This hands-on workshop introduces participants to data analysis using Public Use Microdata Files (PUMF) from Statistics Canada’s sample surveys.\n\nYou’ll learn how to access, manage, and analyze microdata to uncover meaningful insights. Using sample datasets, we’ll walk through various statistical techniques and give you practical experience in interpreting and presenting your findings.\n\nBy the end of this session, participants will be able to:\n\n\n\t\n\tLocate and access Statistics Canada PUMF dataset\n\t\n\t\n\tOrganize and manage microdata for analysis\n\t\n\t\n\tApply basic statistical techniques to explore the data\n\t\n\t\n\tInterpret and present results with clarity and confidence\n\t\n\n\nThis session is ideal for students, faculty, staff, and community members interested in Canadian data—no prior experience required.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Vivek Jadon (he/him) provides research support in the use of numeric research data. As part of his role, Vivek is McMaster University’s official representative for Statistics Canada’s Data Liberation Initiative (DLI) program and Inter-university Consortium for Political and Social Research (ICPSR). Both of these programs provide researchers with vast archive of research data from various disciplines for high quality research and instruction. Vivek is also involved in building awareness and promoting RDM activities/services at McMaster.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. \n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/microdata-python",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753710862.png"
  },
  {
    "uid": "LibCal-7565-3919685",
    "title": "Best Practices for Managing Data in your Research",
    "start": "2026-01-14T10:30:00 EST",
    "end": "2026-01-14T11:30:00 EST",
    "description": "TIFU (Today I F'ed Up) by losing a ton of data for my research - Have you ever seen a description like this on Reddit? Are your desktop and downloads folders a jumble of files named Data-finalFINAL-USETHISONE? Is all of your lab's data stored on a single drive located conveniently under a sprinkler system? Join research data management services and learn how investing a small amount of time in organizing your data now can save you a lot of time and prevent future headaches. In this introductory workshop, learn about research data management best practices. We will go over best practices for data planning, storage, organization, preservation, and sharing.\n\nBy the end of the session, participants will be empowered to:\n\n\n\tProduce a plan for their data\n\tOrganize and document their data consistently\n\tStore and back-up their data securely,\n\tSelect an appropriate data repository for archival and sharing.\n\n\nNo prior experience with data management is required! This session is perfect for anyone who wants to feel more confident organizing, storing, and sharing their data in clear and practical ways.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: \n\nIsaac Pratt (he/him) is a research scientist by training and has a PhD in Anatomy & Cell Biology. He leverages nearly a decade of interdisciplinary research experience to help support students, staff, and faculty. His expertise lies in questions surrounding data storage, security, planning, archival, and sharing. Isaac also provides support and curation services for McMaster Dataverse. His other interests include reproducible research methods, open science, and data science.\n\nDanica Evering holds expansive experience with research support, education, project management, advocacy, and knowledge translation; with fluency in social practice art, healthcare, community research, data, and systems development. Danica supports students, postdocs, faculty, and staff with RDM through the data lifecycle—Data Management Plans, storage and backup, data security, data sharing. With an MA in Media Studies from Concordia, they are interested in fostering RDM within curious scholars and disciplines.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. It is also eligible for the Canadian Certificate for Digital Humanities. To learn more, visit ccdhhn.ca or contact scds@mcmaster.ca.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/intro-rdm2",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753381862.png"
  },
  {
    "uid": "LibCal-7565-3920896",
    "title": "Introduction to R Programming",
    "start": "2026-01-15T13:30:00 EST",
    "end": "2026-01-15T15:30:00 EST",
    "description": "Curious about R but not sure where to start? This beginner-friendly workshop is designed for those with no prior experience in R programming. You’ll get hands-on with RStudio, explore key data types and data structures, and learn how to perform basic data manipulation. By the end, you’ll be able to write and run your own R scripts with confidence.\n\nThis session will take place synchronously and will be recorded and shared publicly for future reference.\n\nIn the workshop, participants will learn to:\n\n\n\tNavigate the RStudio environment\n\tUnderstand and use basic data types and structures in R\n\tWrite and run simple R scripts\n\tPerform basic data manipulation tasks\n\n\nWhether you're working with data in the sciences, humanities, or social sciences, this workshop offers a strong foundation to begin your R programming journey.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: \n\nVivek Jadon (he/him) provides research support in the use of numeric research data. As part of his role, Vivek is McMaster University’s official representative for Statistics Canada’s Data Liberation Initiative (DLI) program and Inter-university Consortium for Political and Social Research (ICPSR). Both of these programs provide researchers with vast archive of research data from various disciplines for high quality research and instruction. Vivek is also involved in building awareness and promoting RDM activities/services at McMaster.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. \n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/intro-r2",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753712350.png"
  },
  {
    "uid": "LibCal-7565-3919873",
    "title": "Map Making for Absolute Beginners using QGIS",
    "start": "2026-01-20T13:30:00 EST",
    "end": "2026-01-20T14:30:00 EST",
    "description": "Interested in digital mapping, but unsure of where to start? This beginner-focused workshop introduces you to the fundamentals of geographic data and teaches you how to create digital maps using QGIS, a free and open-source geographic information system (GIS). QGIS is available free of charge to everyone, including current students, staff, and faculty at McMaster University. It’s a great starting point for anyone looking to explore mapping in their research, projects, or creative work.\n\nBy the end of this workshop, participants will be able to:\n\n\n\tDescribe what geographic data is and explain the basic functions of geographic information systems (GIS).\n\tIdentify and navigate the main components of the QGIS graphical user interface.\n\tAccess and use geospatial web services within QGIS.\n\tUnderstand the purpose of coordinate reference systems and apply them in QGIS.\n\tCreate a basic map layout using the QGIS print layout tool.\n\n\nAbsolutely no geography or quantitative background is necessary for an engaging experience. This session is great for beginners who are curious about mapping and want to explore how geographic data can be used to create digital maps with QGIS.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Saman’s (she/her) work operates at the intersection of information science and critical geography. She’s particularly interested in the ways in which community-owned and -governed infrastructure can contribute to equitable knowledge systems. Currently, Saman takes care of McMaster’s Lloyd Reeds Map Collection, ensuring community members are able to access, understand, and use the collection for teaching and research.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. \n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": "Sherman Centre for Digital Scholarship (1st Floor, Mills Library)",
    "url": "https://libcal.mcmaster.ca/calendar/scds/intro-qgis-2",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753391361.png"
  },
  {
    "uid": "LibCal-7565-3919883",
    "title": "Tracking the Impact of Non-Traditional Research Outputs",
    "start": "2026-01-21T11:00:00 EST",
    "end": "2026-01-21T12:00:00 EST",
    "description": "From datasets and code to podcasts, reports, and performances, not all research outputs take the form of journal articles or books. These are known as Non-Traditional Research Outputs (NTROs)—scholarly or creative works that fall outside conventional academic publishing. While NTROs make up a significant and growing part of research activity, they are often under-recognized in systems that track and assess research impact. In this webinar, participants will explore current best practices for tracking and expressing the impact of NTROs and learn how these practices align with movements, like the San Francisco Declaration on Research Assessment (DORA), advocating for more responsible research assessment.\n\nParticipants will learn how to:\n\n\n\tCreate persistent identifiers (e.g. DOIs) and metadata records for NTROs.\n\tIncorporate NTROs into existing researcher profile systems (e.g. ORCiD; McMaster Experts).\n\tCommunicate the value of NTROs to responsible research assessment practices.\n\n\nThis session is ideal for researchers, creators, and academic staff working with non-traditional outputs who want to make their work more visible, trackable, and valued.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Jack Young (he/him) is McMaster’s Research Impact Librarian, supporting the use of bibliometric data to enhance the reporting and strategic planning practices of the University’s academic departments, institutes, and researchers.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. It is also eligible for the Canadian Certificate for Digital Humanities. To learn more, visit ccdhhn.ca or contact scds@mcmaster.ca.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/ntros",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753392047.png"
  },
  {
    "uid": "LibCal-7565-3920118",
    "title": "Conducting Meta-Analysis for Systematic Reviews Using R",
    "start": "2026-01-22T16:00:00 EST",
    "end": "2026-01-22T17:30:00 EST",
    "description": "Are you working on a systematic review and want to take it to the next step? In this beginner-friendly workshop, we’ll walk through the essential steps to perform a meta-analysis using R, with a focus on practical application and clear interpretation.\n\nIn this hands-on workshop, you’ll learn how to conduct a meta-analysis tailored for systematic reviews of RCTs. We’ll use R, a free, open-source statistical software, to guide you through importing data, calculating effect sizes, assessing heterogeneity, and producing forest plots. Whether you’re new to meta-analysis or just need a refresher, this session offers a practical entry point into evidence synthesis using reproducible, code-based workflows.\n\nln this workshop, participants will learn to:\n\n\n\tRun a meta-analysis and create a forest plot\n\tPerform subgroup analyses\n\tCreate funnel plots for publication bias\n\n\nNo prior experience with meta-analysis is required. This workshop is ideal for researchers who are conducting or planning to conduct systematic reviews involving RCTs. Basic familiarity with R (e.g., running R scripts or using RStudio) is helpful but not required. We’ll provide all the code and walk through each step together.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Sahar is a PhD candidate in the Health Research Methodology program at McMaster University with a background in midwifery. She supports researchers in data analysis using statistical software such as R, SAS, and SPSS, research methodology, and evidence synthesis.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. \n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/meta-analysis-r",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753417527.png"
  },
  {
    "uid": "LibCal-7565-3919894",
    "title": "Streamline Your Research Materials Photos with Tropy",
    "start": "2026-01-27T13:00:00 EST",
    "end": "2026-01-27T14:00:00 EST",
    "description": "You've been there--getting home from an incredible research trip to an archive, maps collection, or gallery only to face down thousands of photos all labelled \"IMG50293.png.\" Join Research Data Management Specialist Danica Evering and Data Analysis and Visualization Librarian Subhanya Sivajothy for an overview of Tropy: a free and open-source solution to explore and manage research photos. In this webinar, you will learn how to use Tropy to zoom into details, tag and organize content with metadata, and begin uncovering patterns across your sources. We will also explore how Tropy connects with Zotero for reference management and Omeka for building digital exhibits, offering a full workflow from research to public presentation.\n\nIn this hands-on workshop, participants will learn to:\n\n\n\tUse Tropy to organize, annotate, analyze and manage research materials image collections.\n\tSelect appropriate metadata and implement documentation and tagging systems.\n\tIntegrate Tropy with Zotero and Omeka to cite archival sources and enhance the impact of your research and digital exhibitions.\n\n\nNo prior knowledge of the software will be required but please come with a version of the software downloaded for the demo! We'll be doing some hands-on experimentation with the software to get you familiar with these tools.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: \n\nDanica Evering holds broad experience with research support, education, project management, advocacy, and knowledge translation; with fluency in social practice art, healthcare, community research, data, and systems development. Danica supports students, postdocs, faculty, and staff with RDM through the data lifecycle—Data Management Plans, storage and backup, data security, data sharing. With an MA in Media Studies from Concordia, they are interested in fostering RDM within curious scholars and disciplines.\n\nSubhanya Sivajothy (she/her) brings a background of research in data justice, science and technology studies, and environmental humanities. She is currently thinking through participatory data design which allow for visualizations that are empowering for the end user.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. It is also eligible for the Canadian Certificate for Digital Humanities. To learn more, visit ccdhhn.ca or contact scds@mcmaster.ca.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/tropy",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753392711.png"
  },
  {
    "uid": "LibCal-7565-3920898",
    "title": "Introduction to Data Analysis with SPSS",
    "start": "2026-01-29T13:30:00 EST",
    "end": "2026-01-29T15:30:00 EST",
    "description": "Looking for an accessible way to analyze data? SPSS is a widely used statistical software that makes it easy to explore, summarize, and interpret data—no programming required.\n\nThis beginner-friendly workshop introduces SPSS through hands-on activities using its point-and-click interface. You’ll learn how to import data, run basic descriptive statistics, and perform simple analyses like t-tests and correlations.\n\nBy the end of this session, participants will be able to:\n\n\n\tNavigate the SPSS interface and load data\n\tRun descriptive statistics such as means, frequencies, and standard deviations\n\tConduct basic statistical tests (e.g., t-tests, correlations)\n\tInterpret and export results from SPSS\n\n\nThis session is ideal for students, researchers, and staff who want a user-friendly introduction to statistical analysis. No prior experience required!\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Vivek Jadon (he/him) provides research support in the use of numeric research data. As part of his role, Vivek is McMaster University’s official representative for Statistics Canada’s Data Liberation Initiative (DLI) program and Inter-university Consortium for Political and Social Research (ICPSR). Both of these programs provide researchers with vast archive of research data from various disciplines for high quality research and instruction. Vivek is also involved in building awareness and promoting RDM activities/services at McMaster.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/intro-spss2",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753712801.png"
  },
  {
    "uid": "LibCal-7565-3920119",
    "title": "Visualizing Your Data: Creating Effective Plots with ggplot2 in R",
    "start": "2026-02-05T16:00:00 EST",
    "end": "2026-02-05T17:00:00 EST",
    "description": "Ever struggled to turn raw data into clear, compelling visuals? Whether you're presenting findings, exploring patterns, or just trying to make your data speak, effective visualization is key. In this workshop, you'll learn how to use ggplot2, a popular R package, to create publication-ready plots that reveal insights and tell stories.\n\nThis hands-on workshop introduces ggplot2, a powerful and flexible data visualization package in R based on the grammar of graphics. You’ll learn how to create and customize a variety of plot types—such as bar charts, scatter plots, histograms, and line graphs—while also learning how to choose the most appropriate visualization for different types of data. Whether you’re new to R or want to improve the way you communicate data, this session offers practical guidance and reusable code to get you started.\n\nIn this workshop, participants will learn to:\n\n\n\tDescribe the key components of the grammar of graphics used in ggplot2\n\tApply ggplot2 techniques to effectively communicate data insights in R\n\tCreate basic visualizations such as bar charts, scatter plots, histograms, and line graphs using ggplot2\n\tChoose appropriate plot types for different kinds of data\n\tCustomize plots by modifying aesthetics, adding labels, adjusting color schemes, and applying themes\n\n\nNo prior experience with R Studio is required. This workshop is ideal for researchers who are looking to enhance their data storytelling skills through visualization.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Sahar is a PhD candidate in the Health Research Methodology program at McMaster University with a background in midwifery. She supports researchers in data analysis using statistical software such as R, SAS, and SPSS, research methodology, and evidence synthesis.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. \n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/ggplot2",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753417886.png"
  },
  {
    "uid": "LibCal-7565-3920107",
    "title": "Create a Digital Exhibition with Omeka S",
    "start": "2026-02-06T10:00:00 EST",
    "end": "2026-02-06T13:00:00 EST",
    "description": "Have a creative project you want to showcase online? Join this hands-on bootcamp to kickstart building your own digital exhibition site using Omeka S, a free and open-source web publishing platform designed for creating and managing online archives and exhibits.\n\nIn this workshop, we will cover Omeka S fundamentals, including best practices for organizing archival item collections, adding detailed metadata, and setting up a basic website. We will also explore more advanced features like creating interactive elements and using modules to extend your site’s functionality. Whether you come with a project idea or just want to learn the platform, there will be dedicated time to develop your own site with support available throughout the session.\n\nBy the end of this bootcamp, you will:\n\n\n\tLearn how to add and manage items in Omeka S\n\tUnderstand key features that make digital exhibitions engaging and effective, and have your exhibit reviewed by the instructor.\n\n\nThis session is great for researchers, students, librarians, archivists, artists, and anyone interested in digital storytelling, online archiving, or building accessible web exhibitions! No prior experience with Omeka or web publishing is required.\n\nDetails: Any preparatory work for the session can be found on its information page. This workshop will not be recorded.\n\nFacilitator Bio: Subhanya (she/her) brings a background of research in data justice, science and technology studies, and environmental humanities. She is currently thinking through participatory data design which allow for visualizations that are empowering for the end user.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. It is also eligible for the Canadian Certificate for Digital Humanities. To learn more, visit ccdhhn.ca or contact scds@mcmaster.ca.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": "Sherman Centre for Digital Scholarship (1st Floor, Mills Library)",
    "url": "https://libcal.mcmaster.ca/calendar/scds/OmekaBootcamp",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753404889.png"
  },
  {
    "uid": "LibCal-7565-3920108",
    "title": "Rethinking “Good” Data: Power, Vulnerability, and Queer Data Care",
    "start": "2026-02-09T12:00:00 EST",
    "end": "2026-02-09T13:00:00 EST",
    "description": "Data is never truly neutral. It is imagined, created, managed, and archived through the perspectives, values, and lived experiences of those who produce it. This workshop introduces queer data care, a feminist framework that challenges conventional understandings of “good” or “gold standard” research (Compton, 2018) and invites more ethical, accountable, and justice-oriented approaches to working with data. Together, we will explore how data practices are shaped by, and can reinforce, existing power structures. We will then examine alternative strategies for collecting, maintaining, and sharing data that center care, collaboration, and community.\n\nGuided by questions such as: How is data maintained? Who controls access? Who is most at-risk during data collection? And how can we collect data that more effectively serves marginalized communities while remaining attentive to the ways data collection can also heighten their vulnerability? —this workshop will guide participants through a reflection on and reimagining of data practices through case studies.\n\nIn this workshop, we will:\n\n\n\tAnalyze how social, political, and disciplinary contexts might shape data practices\n\tIdentify how data practices can reinforce or resist structural power dynamics, particularly in relation to marginalized communities.\n\tDevelop ethical, accountable, and community-centered approaches to data collection, maintenance, and access.\n\tApply these methods and principles to your own research projects, and/or case studies.\n\n\nThis workshop is for anyone interested in thinking differently about data, such as graduate students, librarians, community researchers, data professionals, and others engaged in research, advocacy, or knowledge production. No formal experience with data is required. We all generate and interact with data in our everyday lives!\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: \n\nAlexis-Carlota Cochrane (she/they) is the Digital Scholarship Coordinator at the Sherman Centre for Digital Scholarship. In her role, she connects students, faculty, staff, and community members to resources, tools, and training that advance their digital research projects. Alexis is also PhD Candidate in the Department of Communication Studies and Media Arts at McMaster University. Her research interests include critical data studies, platform studies, data feminism, online harms, data justice, and digital humanities.\n\nDanica Evering holds broad experience with research support, education, project management, advocacy, and knowledge translation; with fluency in social practice art, healthcare, community research, data, and systems development. Danica supports students, postdocs, faculty, and staff with RDM through the data lifecycle—Data Management Plans, storage and backup, data security, data sharing. With an MA in Media Studies from Concordia, they are interested in fostering RDM within curious scholars and disciplines.\n\nSubhanya Sivajothy (she/her) brings a background of research in data justice, science and technology studies, and environmental humanities. She is currently thinking through participatory data design which allow for visualizations that are empowering for the end user.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. It is also eligible for the Canadian Certificate for Digital Humanities. To learn more, visit ccdhhn.ca or contact scds@mcmaster.ca.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/rethinking-data",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753409906.png"
  },
  {
    "uid": "LibCal-7565-3920109",
    "title": "Finding, Accessing, and Adding GIS Data to Your Project",
    "start": "2026-02-10T10:30:00 EST",
    "end": "2026-02-10T11:30:00 EST",
    "description": "Looking for data to power your digital mapping project? Geospatial data contains location information and can be mapped using Geographic Information Systems (GIS) software. Mapping geospatial data helps us see patterns, create visualizations, and make informed decisions. This workshop introduces participants to geospatial data formats as well as reliable sources for this data.\n\nParticipants will learn to:\n\n\n\tdifferentiate between geospatial data models\n\tlocate datasets using common sources for geospatial data\n\tevaluate a dataset for use.\n\n\nThis session is ideal for beginners, researchers, and anyone interested in using location data to enhance their projects. No prior GIS experience is required.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Christine Homuth (she/her) is the Library's GIS Specialist, providing support and resources to students, researchers, and faculty members working with Geographic Information Systems (GIS) and geospatial data.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. \n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/gis-data",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753410764.png"
  },
  {
    "uid": "LibCal-7565-3920110",
    "title": "Visualizing Bibliometric Networks with VOSviewer",
    "start": "2026-02-11T11:00:00 EST",
    "end": "2026-02-11T12:00:00 EST",
    "description": "Curious about how research networks form and evolve? Bibliometric visualizations can help you uncover patterns in scholarly publishing—who’s collaborating, what topics are trending, and how ideas move across disciplines. In this hands-on workshop, you’ll learn how to use VOSviewer, a free and open-source tool designed specifically for visualizing bibliometric networks. Using a large set of publication data, we’ll walk through techniques for analyzing connections at the organizational, author, and document levels, and build compelling network maps that bring bibliometric relationships to life.\n\nBy the end of this session, participants will be able to:\n\n\n\tIdentify appropriate bibliometric techniques for analyzing large publication sets\n\tCreate clear, compelling network visualizations using VOSviewer\n\tInterpret and explain bibliometric network maps to support research impact analysis and exploration\n\n\nThis session is ideal for researchers, librarians, and graduate students interested in research metrics, scholarly communications, or mapping academic influence. No prior experience with VOSviewer is required.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Jack Young (he/him) is McMaster’s Research Impact Librarian, supporting the use of bibliometric data to enhance the reporting and strategic planning practices of the University’s academic departments, institutes, and researchers.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. It is also eligible for the Canadian Certificate for Digital Humanities. To learn more, visit ccdhhn.ca or contact scds@mcmaster.ca.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": "Sherman Centre for Digital Scholarship (1st Floor, Mills Library)",
    "url": "https://libcal.mcmaster.ca/calendar/scds/vosviewer",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753411411.png"
  },
  {
    "uid": "LibCal-7565-3920902",
    "title": "Introduction to Python Programming",
    "start": "2026-02-12T13:30:00 EST",
    "end": "2026-02-12T15:30:00 EST",
    "description": "Interested in learning one of the world’s most popular programming languages? Python is beginner-friendly and widely used across many fields for data analysis, automation, and more.\n\nThis hands-on workshop will introduce you to Python’s basic concepts, including data types, variables, and simple operations on numbers and strings. No prior experience with Python is needed.\n\nBy the end of this session, participants will be able to:\n\n\n\tUnderstand fundamental Python data types and variables\n\tPerform basic operations on numbers and strings\n\tWrite simple Python code to manipulate and store data\n\n\nThis session will be recorded and made publicly available. It’s perfect for anyone looking for a practical introduction to Python programming.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Vivek Jadon (he/him) provides research support in the use of numeric research data. As part of his role, Vivek is McMaster University’s official representative for Statistics Canada’s Data Liberation Initiative (DLI) program and Inter-university Consortium for Political and Social Research (ICPSR). Both of these programs provide researchers with vast archive of research data from various disciplines for high quality research and instruction. Vivek is also involved in building awareness and promoting RDM activities/services at McMaster.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/intro-python2",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753713400.png"
  },
  {
    "uid": "LibCal-7565-3920111",
    "title": "Communities Empowered by Data 101: Tools and Best Practices",
    "start": "2026-02-19T12:00:00 EST",
    "end": "2026-02-19T13:00:00 EST",
    "description": "Community-led data practices empower and support community-led grassroots actions and initiatives. Data are valuable and we need to work together to take care of them, from the initial planning stages of a project to where it lives after the work is complete. In this 101-level session, we’ll introduce the Community Research Data Toolkit—a new Pressbook filled with guidance and resources to support communities in taking an active role in data management. Topics include using data management plans as tools for building trust, exploring options for long-term community-held data, and more. Following an interactive overview, we'll save some time to workshop challenges and possibilities through a set of applicable case studies.\n\nParticipants will learn to:\n\n\n\tSummarize RDM best practices and what Data Management Plans and Data Deposit look like in community-based research\n\tLocate available tools, training, and guidance\n\tAppraise the tools and prepare to implement Community control for data in your work.\n\n\nThis session is designed for non-profits, activists, community organizations, and the researchers and data professionals who work with them!\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: \n\nDanica Evering holds broad experience with research support, education, project management, advocacy, and knowledge translation; with fluency in social practice art, healthcare, community research, data, and systems development. Danica supports students, postdocs, faculty, and staff with RDM through the data lifecycle—Data Management Plans, storage and backup, data security, data sharing. With an MA in Media Studies from Concordia, they are interested in fostering RDM within curious scholars and disciplines.\n\nIsaac Pratt (he/him) is a research scientist by training and has a PhD in Anatomy & Cell Biology. He leverages nearly a decade of interdisciplinary research experience to help support students, staff, and faculty. His expertise lies in questions surrounding data storage, security, planning, archival, and sharing. Isaac also provides support and curation services for McMaster Dataverse. His other interests include reproducible research methods, open science, and data science.\n\nSubhanya Sivajothy (she/her) brings a background of research in data justice, science and technology studies, and environmental humanities. She is currently thinking through participatory data design which allow for visualizations that are empowering for the end user.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. It is also eligible for the Canadian Certificate for Digital Humanities. To learn more, visit ccdhhn.ca or contact scds@mcmaster.ca.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": "Sherman Centre for Digital Scholarship (1st Floor, Mills Library)",
    "url": "https://libcal.mcmaster.ca/calendar/scds/community-data",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753412040.png"
  },
  {
    "uid": "LibCal-7565-3920112",
    "title": "Create an Interactive Dashboard using ArcGIS",
    "start": "2026-03-10T10:30:00 EDT",
    "end": "2026-03-10T11:30:00 EDT",
    "description": "Need to present data in a way that's visual, interactive, and easy to understand? ArcGIS Dashboards lets you combine maps, charts, and text to create web-based dashboards that clearly communicate your data’s story.\n\nIn this beginner-friendly workshop, you'll learn how to use ArcGIS Dashboards to display and explore openly available data through dynamic maps and charts—no prior experience needed. We will walk through creating a basic map and designing a dashboard that helps convey meaningful information to your audience through clear visual elements.\n\nBy the end of the session, participants will be able to:\n\n\n\tUse data from an open data portal to create a map in ArcGIS Online\n\tDesign, build, and publish an interactive dashboard using ArcGIS Dashboards\n\n\nThis session is ideal for anyone looking to present data in clear and engaging ways.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Christine Homuth (she/her) is the Library's GIS Specialist, providing support and resources to students, researchers, and faculty members working with Geographic Information Systems (GIS) and geospatial data.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. \n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/arcgis-dashboards",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753413504.png"
  },
  {
    "uid": "LibCal-7565-3920113",
    "title": "Social Media Data! Practical and Ethical Collection, Visualization, and Management",
    "start": "2026-03-19T13:00:00 EDT",
    "end": "2026-03-19T14:30:00 EDT",
    "description": "From Reddit threads to TikTok trends, social media is deeply embedded in our daily lives. These platforms fuel polarization, connect queer communities, raise awareness about rare diseases, amplify both grassroots movements and gender-based violence, and even shape the new recipes we cook for dinner. With this flood of seemingly public content, it’s no surprise that researchers are increasingly turning to social media as a rich (and complicated!) source of data.\n\nThis hands-on workshop covers both practical techniques and ethical considerations for working with social media data. You’ll learn from experts across digital scholarship, research data management, and data analysis:\n\n\n\tHow to Collect to Social Media Data: Digital Scholarship Librarian John Fink will demo manual collection and scraping tools like the Digital Methods Initiative's Zeeschuimer and 4CAT.\n\tHow to Analyze Social Media Data: Data Analysis and Visualization Librarian Subhanya Sivajothy will intro how to comb through social media data and show patterns.\n\tHow to Manage Social Media Data: Research Data Management Specialist Danica Evering will share tools and best practices for wrangling and organizing social media data.\n\tHow to Navigate Social Media Data Ethics: Digital Scholarship Coordinator Alexis-Carlota Cochrane will explore ethical considerations for researching social media, including strategies for protecting privacy and minimizing harm throughout the research and publication process.\n\n\nBy the end of this workshop, participants will be able to:\n\n\n\tCollect social media data using both manual and automated scraping tools like Zeeschuimer and 4CAT.\n\tAnalyze datasets to identify key trends and insights with introductory data exploration techniques.\n\tOrganize and manage social media data effectively by applying recommended best practices and tools.\n\tUnderstand and address ethical challenges in social media research, including protecting privacy and minimizing harm at all stages.\n\n\nThis session is ideal for researchers, students, and practitioners across disciplines who are curious about using social media data in their work and want to approach it thoughtfully, ethically, and responsibly.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: \n\nAlexis-Carlota Cochrane (she/they) is the Digital Scholarship Coordinator at the Sherman Centre for Digital Scholarship. In her role, she connects students, faculty, staff, and community members to resources, tools, and training that advance their digital research projects. Alexis is also PhD Candidate in the Department of Communication Studies and Media Arts at McMaster University. Her research interests include critical data studies, platform studies, data feminism, online harms, data justice, and digital humanities.\n\nDanica Evering holds broad experience with research support, education, project management, advocacy, and knowledge translation; with fluency in social practice art, healthcare, community research, data, and systems development. Danica supports students, postdocs, faculty, and staff with RDM through the data lifecycle—Data Management Plans, storage and backup, data security, data sharing. With an MA in Media Studies from Concordia, they are interested in fostering RDM within curious scholars and disciplines.\n\nJohn Fink is the Digital Scholarship Librarian in the Sherman Centre.\n\nSubhanya Sivajothy (she/her) brings a background of research in data justice, science and technology studies, and environmental humanities. She is currently thinking through participatory data design which allow for visualizations that are empowering for the end user.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. It is also eligible for the Canadian Certificate for Digital Humanities. To learn more, visit ccdhhn.ca or contact scds@mcmaster.ca.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/social-media",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753414254.png"
  },
  {
    "uid": "LibCal-7565-3920106",
    "title": "Creating Data Visualizations with Javascript",
    "start": "2026-03-26T13:00:00 EDT",
    "end": "2026-03-26T14:30:00 EDT",
    "description": "Ready to bring your data to life? This hands-on workshop will equip you with the essential skills to transform data into compelling and interactive visualizations using Plotly.js, a powerful open-source graphing library. In this introductory session, we’ll use Plotly to create a range of common chart types and gradually build skills toward more advanced and customized visualizations.\n\nParticipants will learn how to:\n\n\n\tUnderstand the basic building blocks of creating data visualizations with Plotly.\n\tApply Plotly's fundamental syntax to generate distinct chart types from provided datasets, accurately representing the underlying data.\n\tAnalyze a given dataset and select the most appropriate Plotly chart type for effective visual communication based on data characteristics and visualization best practices.\n\n\nNo prior Plotly experience is required, but basic Javascript familiarity is recommended. This session is ideal for data enthusiasts, researchers, developers, and anyone looking to create dynamic, web-based visualizations to communicate data insights effectively.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Subhanya (she/her) brings a background of research in data justice, science and technology studies, and environmental humanities. She is currently thinking through participatory data design which allow for visualizations that are empowering for the end user.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/DataVizJavascript",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1754067239.png"
  },
  {
    "uid": "LibCal-7565-3920904",
    "title": "Microdata Analysis with Python using Statistics Canada Data",
    "start": "2026-04-02T13:30:00 EDT",
    "end": "2026-04-02T15:30:00 EDT",
    "description": "Want to learn how to work with rich Canadian survey data? The Public Use Microdata File (PUMF) from Statistics Canada offers detailed microdata from national sample surveys—perfect for uncovering meaningful insights.\n\nIn this hands-on workshop, you’ll learn how to access, manage, and analyze PUMF datasets. Through practical exercises, you’ll explore statistical techniques and develop skills to interpret and present your findings effectively.\n\nBy the end of this session, participants will be able to:\n\n\n\tAccess and navigate Statistics Canada’s PUMF datasets\n\tManage microdata for analysis using common tools\n\tApply basic statistical methods to extract insights\n\tInterpret and communicate results from survey data\n\n\nThis workshop is ideal for students, faculty, staff, and community members interested in exploring national data.\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: Vivek Jadon (he/him) provides research support in the use of numeric research data. As part of his role, Vivek is McMaster University’s official representative for Statistics Canada’s Data Liberation Initiative (DLI) program and Inter-university Consortium for Political and Social Research (ICPSR). Both of these programs provide researchers with vast archive of research data from various disciplines for high quality research and instruction. Vivek is also involved in building awareness and promoting RDM activities/services at McMaster.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. \n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": null,
    "url": "https://libcal.mcmaster.ca/calendar/scds/microdata-python2",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753713704.png"
  },
  {
    "uid": "LibCal-7565-3920114",
    "title": "Students deserve Research Data Management! Teaching with the RDM Educators Kit",
    "start": "2026-05-05T13:00:00 EDT",
    "end": "2026-05-05T14:00:00 EDT",
    "description": "Your students deserve to know about Research Data Management! In this brand-new \"train the trainer\" session for educators, RDM Services will prepare you to prepare your graduate and undergraduate students for increasing grant and publisher requirements for Data Management Plans and Data Deposit.\n\n\"Do my students even have data to manage?\" you might ask. Au contraire mon capitane, they do! If research involves biological samples or survey results, you may feel confident you’re working with research data. But what if your research is rooted in creative practice? What if you’re looking for the specific heat of a material under a magnetic field? Data have many formats: text, numbers, images, recordings, software, algorithms, workflows. Research Data Management is caring for data through the research lifecycle: planning to archiving.\n\nWe'll discuss integrating our new RDM Educators Kit in the classroom, from 2-minute slide inserts to RDM class visits to multi-class Data Management Plan creation as an \"open hand of cards.\" We'll end with a working session to imagine challenges and possibilities!\n\nParticipants will learn to:\n\n\n\tSummarize RDM best practices and what Data Management Plans and Data Deposit look like in your field\n\tLocate available tools from RDM Services\n\tPrepare to implement Research Data Management tools in the classroom.\n\n\nThis session is great for educators from faculty to sessional instructors to graduate students ready to bring RDM into their classrooms!\n\nDetails: Any preparatory work for the session can be found on its information page. This virtual workshop will be recorded and shared on the same page, and discoverable via the Sherman Centre's Online Learning Catalogue.\n\nFacilitator Bio: \n\nIsaac Pratt (he/him) is a research scientist by training and has a PhD in Anatomy & Cell Biology. He leverages nearly a decade of interdisciplinary research experience to help support students, staff, and faculty. His expertise lies in questions surrounding data storage, security, planning, archival, and sharing. Isaac also provides support and curation services for McMaster Dataverse. His other interests include reproducible research methods, open science, and data science.\n\nDanica Evering holds expansive experience with research support, education, project management, advocacy, and knowledge translation; with fluency in social practice art, healthcare, community research, data, and systems development. Danica supports students, postdocs, faculty, and staff with RDM through the data lifecycle—Data Management Plans, storage and backup, data security, data sharing. With an MA in Media Studies from Concordia, they are interested in fostering RDM within curious scholars and disciplines.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. It is also eligible for the Canadian Certificate for Digital Humanities. To learn more, visit ccdhhn.ca or contact scds@mcmaster.ca.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": "Sherman Centre for Digital Scholarship (1st Floor, Mills Library)",
    "url": "https://libcal.mcmaster.ca/calendar/scds/teach-rdm",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753414861.png"
  },
  {
    "uid": "LibCal-7565-3920115",
    "title": "Data Management Plan Bootcamp (In-Person)",
    "start": "2026-05-12T13:00:00 EDT",
    "end": "2026-05-12T16:00:00 EDT",
    "description": "Let us be your body double with this in-person bootcamp! Data Management Plans (DMPs) are both incredibly helpful research tools and increasingly required for grants but it can hard to know how to complete a Data Management Plan if it’s your first time. If you're in the process of creating a DMP, either for a grant application or for your own research, join RDM Services for this afternoon session. The RDM services team will provide tailored guidance as you write your plan on site, and we'll have some light snacks and refreshments to keep you going. Come away with a clear path forward or even a finished DMP!\n\nBy the end of this session, participants will be able to:\n\n\n\tIdentify the 5 key components of a data management plan (DMP).\n\tCompare strong and weak responses in each section of a DMP.\n\tDevelop a tailored outline, or potentially a complete draft, of their own DMP!\n\n\nThis participatory session is especially relevant for researchers at all levels in the beginning stages of a research project or streamlining best practices for their research team. Pair this with our Data Deposit Bootcamp May 19, 2026 for a spring research data management intensive for graduate researchers and research staff. Come on your own, send your research staff, or bring your whole research group. Let us know if you're joining as a research team - we'll make sure you get a table to work together at!\n\nDetails: Any preparatory work for the session can be found on its information page. This workshop will not be recorded.\n\nFacilitator Bio: \n\nIsaac Pratt (he/him) is a research scientist by training and has a PhD in Anatomy & Cell Biology. He leverages nearly a decade of interdisciplinary research experience to help support students, staff, and faculty. His expertise lies in questions surrounding data storage, security, planning, archival, and sharing. Isaac also provides support and curation services for McMaster Dataverse. His other interests include reproducible research methods, open science, and data science.\n\nDanica Evering holds expansive experience with research support, education, project management, advocacy, and knowledge translation; with fluency in social practice art, healthcare, community research, data, and systems development. Danica supports students, postdocs, faculty, and staff with RDM through the data lifecycle—Data Management Plans, storage and backup, data security, data sharing. With an MA in Media Studies from Concordia, they are interested in fostering RDM within curious scholars and disciplines.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. It is also eligible for the Canadian Certificate for Digital Humanities. To learn more, visit ccdhhn.ca or contact scds@mcmaster.ca.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": "Sherman Centre for Digital Scholarship (1st Floor, Mills Library)",
    "url": "https://libcal.mcmaster.ca/calendar/scds/dmp-bootcamp3",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1754067866.png"
  },
  {
    "uid": "LibCal-7565-3920116",
    "title": "Data Deposit Bootcamp (In-Person)",
    "start": "2026-05-19T13:00:00 EDT",
    "end": "2026-05-19T16:00:00 EDT",
    "description": "Data deposit and data sharing are increasingly recognized as best practice to support open research, reproducibility, research integrity, collaboration, and more. Disciplines, funders, and journals are increasingly requiring researchers to share or deposit data. But how do you get your dataset ready for sharing? What's the best repository to share it in? With light snacks and refreshments to sustain you and specialists on-hand to answer any questions, you'll end this session with ready-to-submit data...or submitted or even published data!\n\nBy the end of this 3-hour session, you will be able to:\n\n\n\tIdentify the appropriate repository for their dataset.\n\tOutline documentation and metadata best practices\n\tDevelop a README file that thoroughly describes the dataset being deposited.\n\tOrganize datasets in preparation for data deposit, including metadata entry.\n\n\nIf you have a dataset that's ready for deposit or that you'd like to get deposit ready, bring it along. No dataset? No problem! We have a sample dataset you can use to go through the process and learn how to deposit data.\n\nThis session is ideal for researchers, staff, and students preparing to share data for a publication, grant, or project—and for anyone interested in open data best practices. Graduate students who have completed their thesis work are especially encouraged to attend! Pair this with our Data Management Plan Bootcamp May 12, 2026 for a spring research data management intensive for graduate researchers and research staff. \n\nDetails: Any preparatory work for the session can be found on its information page. This workshop will not be recorded.\n\nFacilitator Bio: \n\nIsaac Pratt (he/him) is a research scientist by training and has a PhD in Anatomy & Cell Biology. He leverages nearly a decade of interdisciplinary research experience to help support students, staff, and faculty. His expertise lies in questions surrounding data storage, security, planning, archival, and sharing. Isaac also provides support and curation services for McMaster Dataverse. His other interests include reproducible research methods, open science, and data science.\n\nDanica Evering holds expansive experience with research support, education, project management, advocacy, and knowledge translation; with fluency in social practice art, healthcare, community research, data, and systems development. Danica supports students, postdocs, faculty, and staff with RDM through the data lifecycle—Data Management Plans, storage and backup, data security, data sharing. With an MA in Media Studies from Concordia, they are interested in fostering RDM within curious scholars and disciplines.\n\nCertificate Eligibility: This workshop is eligible for the Sherman Centre's certificate program. For more information, visit scds.ca/certificate-program. It is also eligible for the Canadian Certificate for Digital Humanities. To learn more, visit ccdhhn.ca or contact scds@mcmaster.ca.\n\nCredit Eligibility: This workshop counts toward credit for students in the Faculty of Science who are enrolled in SCIENCE 2SF1: Digital Skills Workshop. For any questions, please contact oursci@mcmaster.ca.",
    "location": "Sherman Centre for Digital Scholarship (1st Floor, Mills Library)",
    "url": "https://libcal.mcmaster.ca/calendar/scds/data-deposit-bootcamp",
    "image": "https://devgj00vx92jb.cloudfront.net/data/feat_img/4102/7565/1753416705.png"
  }
]